In [9]:
import itertools
import pandas as pd
import psycopg2
import sqlg
import re
import numpy as np
import logging
import os
from random import random, seed
from multiprocessing import Pool
from tqdm import tqdm
from collections import defaultdict, Counter
from sqlalchemy import create_engine            # dataframe

In [10]:
os.chdir ('/home/workspace/AIDA_KR')

# Create Test

In [11]:
in_fn = "data/ko_wiki.txt"
hidden_fn = "data/hidden_ko_wiki.txt"
train_fn = "data/train_ko_wiki.txt"
answer_fn = "data/answer_ko_wiki.txt"
predict_fn = "data/predict_ko_wiki.txt"
id2title_fn = "data/koid2title.txt"
seed_ = 1
train_ratio = 0.8
num_lines = 176169803
key_morphemes = ['NOUN', 'PROPERNOUN', 'NUMBER']

logging.basicConfig(filename="log.log", filemode='w') 

large_conn = psycopg2.connect("host='localhost' port=5432 dbname='large' user='postgres' password='postgres'")
korean_conn = psycopg2.connect("host='localhost' port=5432 dbname='korean' user='postgres' password='postgres'")
korean_engine = create_engine('postgresql+psycopg2://postgres:postgres@localhost:5432/korean')

In [1]:
! head -n 100 data/ko_wiki.txt

## WIKI_1000009
## 고탄연(高難延, 생몰년 미상)은 백제의 왕족 출신 귀족으로 일본 귀화인이다. 대구조(大丘造) 씨의 시조이다. 백제의 왕족으로 근초고왕의 12세손이었다. 관직은 은솔(恩率)에 이르렀으나 일본으로 망명하였고, 대구조 씨의 시조가 되었다.
## <ENTITY>고탄연:WIKI_1000009</ENTITY>(高難延, 생몰년 미상)은 <ENTITY>백제:WIKI_74135</ENTITY>의 왕족 출신 귀족으로 <ENTITY>일본:WIKI_241789</ENTITY> 귀화인이다. 대구조(大丘造) 씨의 시조이다. <ENTITY>백제:WIKI_74135</ENTITY>의 왕족으로 <ENTITY>근초고왕:WIKI_48407</ENTITY>의 12세손이었다. 관직은 <ENTITY>은솔:WIKI_5409</ENTITY>(恩率)에 이르렀으나 <ENTITY>일본:WIKI_241789</ENTITY>으로 망명하였고, 대구조 씨의 시조가 되었다.
고	고	PRENOUN	B-WIKI_1000009
탄연	탄연	PROPERNOUN	I-WIKI_1000009
(	(	SYM	O
高難延	高難延	SYM	O
,	,	SYM	O
_space_	_space_	_	O
생몰년	생몰년	NOUN	O
_space_	_space_	_	O
미상	미상	NOUN	O
)	)	SYM	O
은	은	JOSA	O
_space_	_space_	_	O
백제	백제	PROPERNOUN	B-WIKI_74135
의	의	JOSA	O
_space_	_space_	_	O
왕족	왕족	NOUN	O
_space_	_space_	_	O
출신	출신	NOUN	O
_space_	_space_	_	O
귀족	귀족	NOUN	O
으로	으로	JOSA	O
_space_	_space_	_	O
일본	일본	PROPERNOUN	B-WIKI_241789
_space_	_space_	_	O
귀화	귀화	NOUN	O
인	인	SUFFIX	O
이다	이다	EOMI	O
.	.	SYM	O
_space_	_space_	_	O
대	대	PRENOUN	O
구조	구조	NOUN	O
(	(	SYM	O
大丘造	大丘造	SYM	O
)	)	SYM	O
_space_	_space_	_	O
씨	씨	NBN_N	O
의	의	JOSA	O
_space_	_space_	_	O
시조	시조	NOUN	O
이다	이다	EOMI	O
.	.	SYM	O
_space_	_space_	_	O
백제	백제	PROPERNOUN	B-WIKI_74135
의	의	JOSA	O
_space_	_space_	_	O
왕족	왕족	NOUN	O
으로	으로	JOSA	O
_space_	_space_	_	O
근초고왕	근초고왕	PROPERNOUN	B-WIKI_48407
의	의	JOSA	O
_space_	_space_	_	O
12	12	NUMBER	O
세	세	NBU	O
손	손	NOUN	O
이었다	이었다	EOMI	O
.	.	SYM	O
_space_	_space_	_	O
관직	관직	NOUN	O
은	은	JOSA	O
_space_	_space_	_	O
은솔	은솔	PROPERNOUN	B-WIKI_5409
(	(	SYM	O
恩率	恩率	SYM	O
)	)	SYM	O
에	에	JOSA	O
_space_	_space_	_	O
이르렀으나	이르렀으나	VERB	O
_space_	_space_	_	O
일본	일본	PROPERNOUN	B-WIKI_241789
으로	으로	JOSA	O
_space_	_space_	_	O
망명	망명	NOUN	O
하였고	하였고	XSP	O
,	,	SYM	O
_space_	_space_	_	O
대	대	PRENOUN	O
구조	구조	NOUN	O
_space_	_space_	_	O
씨	씨	NOUN	O
의	의	JOSA	O
_space_	_space_	_	O
시조	시조	NOUN	O
가	가	JOSA	O
_space_	_space_	_	O
되었다	되었다	VERB	O
.	.	SYM	O
_space_	_space_	_	O

## WIKI_1000013
## 여자신 혹은 여자진은 백제 멸망과 함께 일본으로 망명한 백제의 좌평이다. 일본서기에 따르면 덴지 천황이 오미국 가모군에 거주지를 주었고, 대금하라는 관직을 내려주었다고 한다. 신찬성씨록에 따르면 이는 고야조(高野造)씨의 조상이라고 한다.
## <ENTITY>여자신:WIKI_1000013</ENTITY> 혹은 여자진은 <ENTITY>백제:WIKI_74135</ENTITY> 멸망과 함께 <ENTITY>일본:WIKI_241789</ENTITY>으로 망명한 백제의 좌평이다. <ENTITY>일본서기:WIKI_4872</ENTITY>에 따르면 덴지 천황이 오미국 가모군에 거주지를 주었고, 대금하라는 관직을 내려주었다고 한다. 신찬성씨록에 따르면 이는 고야조(高野造)씨의 조상이라고 한다.
여자신	여자신	PROPERNOUN	B-WIKI_1000013
_space_	_space_	_	O
혹은	혹은	ADVERB	O
_space_	_space_	_	O
여자	여자	NOUN	O
진	진	VERB	O

In [5]:
seed(seed_)
if os.path.isfile(train_fn) or os.path.isfile(answer_fn):
    print("Train or answer file already exists, try remove them before running")
else:
    hidden_entities = set()     # randomly hide 20% entity
    with open(in_fn, encoding='utf8') as in_f, open(hidden_fn, 'w') as hidden_f:
        for line in tqdm(in_f, total=num_lines):
            if line.startswith('## WIKI_'):
                if random() > train_ratio:
                    hidden_entities.add(line[3:])
                    hidden_f.write(line[3:])

    with open(in_fn, encoding='utf8') as in_f, open(train_fn, 'w') as train_f, open(answer_fn, 'w') as answer_f:
        for line in tqdm(in_f, total=num_lines):
            if line.startswith('## WIKI'):
                entity = line[3:]
                train_f.write(line)
                answer_f.write(line)

                def callback(matches):
                    mention = matches.group(1)
                    # randomly hide 20% mention
                    if random() > train_ratio or mention in hidden_entities or entity in hidden_entities:
                        answer_f.write(matches.group(2) + "\n")
                        return '<ENTITY>' + matches.group(1) + ':</ENTITY>'
                    else:
                        return matches.group(0)
                orig_line, tag_line = next(in_f), next(in_f)
                train_f.write(re.sub(r'<ENTITY>(.*?):(.*?)</ENTITY>', callback, tag_line))
            else:
                train_f.write(line)

Train or answer file already exists, try remove them before running

In [7]:
! head -n 100 data/train_ko_wiki.txt
! head data/answer_ko_wiki.txt

## WIKI_1000009
## <ENTITY>고탄연:WIKI_1000009</ENTITY>(高難延, 생몰년 미상)은 <ENTITY>백제:WIKI_74135</ENTITY>의 왕족 출신 귀족으로 <ENTITY>일본:WIKI_241789</ENTITY> 귀화인이다. 대구조(大丘造) 씨의 시조이다. <ENTITY>백제:WIKI_74135</ENTITY>의 왕족으로 <ENTITY>근초고왕:WIKI_48407</ENTITY>의 12세손이었다. 관직은 <ENTITY>은솔:WIKI_5409</ENTITY>(恩率)에 이르렀으나 <ENTITY>일본:WIKI_241789</ENTITY>으로 망명하였고, 대구조 씨의 시조가 되었다.
고	고	PRENOUN	B-WIKI_1000009
탄연	탄연	PROPERNOUN	I-WIKI_1000009
(	(	SYM	O
高難延	高難延	SYM	O
,	,	SYM	O
_space_	_space_	_	O
생몰년	생몰년	NOUN	O
_space_	_space_	_	O
미상	미상	NOUN	O
)	)	SYM	O
은	은	JOSA	O
_space_	_space_	_	O
백제	백제	PROPERNOUN	B-WIKI_74135
의	의	JOSA	O
_space_	_space_	_	O
왕족	왕족	NOUN	O
_space_	_space_	_	O
출신	출신	NOUN	O
_space_	_space_	_	O
귀족	귀족	NOUN	O
으로	으로	JOSA	O
_space_	_space_	_	O
일본	일본	PROPERNOUN	B-WIKI_241789
_space_	_space_	_	O
귀화	귀화	NOUN	O
인	인	SUFFIX	O
이다	이다	EOMI	O
.	.	SYM	O
_space_	_space_	_	O
대	대	PRENOUN	O
구조	구조	NOUN	O
(	(	SYM	O
大丘造	大丘造	SYM	O
)	)	SYM	O
_space_	_space_	_	O
씨	씨	NBN_N	O
의	의	JOSA	O
_space_	_space_	_	O
시조	시조	NOUN	O
이다	이다	EOMI	O
.	.	SYM	O
_space_	_space_	_	O
백제	백제	PROPERNOUN	B-WIKI_74135
의	의	JOSA	O
_space_	_space_	_	O
왕족	왕족	NOUN	O
으로	으로	JOSA	O
_space_	_space_	_	O
근초고왕	근초고왕	PROPERNOUN	B-WIKI_48407
의	의	JOSA	O
_space_	_space_	_	O
12	12	NUMBER	O
세	세	NBU	O
손	손	NOUN	O
이었다	이었다	EOMI	O
.	.	SYM	O
_space_	_space_	_	O
관직	관직	NOUN	O
은	은	JOSA	O
_space_	_space_	_	O
은솔	은솔	PROPERNOUN	B-WIKI_5409
(	(	SYM	O
恩率	恩率	SYM	O
)	)	SYM	O
에	에	JOSA	O
_space_	_space_	_	O
이르렀으나	이르렀으나	VERB	O
_space_	_space_	_	O
일본	일본	PROPERNOUN	B-WIKI_241789
으로	으로	JOSA	O
_space_	_space_	_	O
망명	망명	NOUN	O
하였고	하였고	XSP	O
,	,	SYM	O
_space_	_space_	_	O
대	대	PRENOUN	O
구조	구조	NOUN	O
_space_	_space_	_	O
씨	씨	NOUN	O
의	의	JOSA	O
_space_	_space_	_	O
시조	시조	NOUN	O
가	가	JOSA	O
_space_	_space_	_	O
되었다	되었다	VERB	O
.	.	SYM	O
_space_	_space_	_	O

## WIKI_1000013
## <ENTITY>여자신:</ENTITY> 혹은 여자진은 <ENTITY>백제:</ENTITY> 멸망과 함께 <ENTITY>일본:</ENTITY>으로 망명한 백제의 좌평이다. <ENTITY>일본서기:</ENTITY>에 따르면 덴지 천황이 오미국 가모군에 거주지를 주었고, 대금하라는 관직을 내려주었다고 한다. 신찬성씨록에 따르면 이는 고야조(高野造)씨의 조상이라고 한다.
여자신	여자신	PROPERNOUN	B-WIKI_1000013
_space_	_space_	_	O
혹은	혹은	ADVERB	O
_space_	_space_	_	O
여자	여자	NOUN	O
진	진	VERB	O
은	은	NOUN	O
_space_	_space_	_	O
## WIKI_1000009
## WIKI_1000013
WIKI_1000013
WIKI_74135
WIKI_241789
WIKI_4872
## WIKI_1000015
WIKI_26786
WIKI_459042
WIKI_8133

# Generate Table

## dictionary

In [7]:
display(pd.read_sql_query("select * from dictionary limit 15", large_conn))
display(pd.read_sql_query("select * from dictionary where mention = 'LOD';", large_conn))

                                        mention   entity  prior  entitytype
0               КРААТЦ, ФРИДРИХ ХЕРМАНН ХАЙНРИХ   137445    0.0           0
1                                системы единиц   434324    0.0           1
2                      MINISTERIO DE TRANSPORTE   318651    0.0           0
3                      MINISTERIO DE TRANSPORTE   318651    0.0           1
4                      MINISTERIO DE TRANSPORTE  2316497    1.0           0
5                      MINISTERIO DE TRANSPORTE   208629    0.0           0
6                                 SHARON HORGAN   921878    1.0           0
7                                 ÉLISE CROMBEZ  3598297    1.0           0
8                                   warder park  6721261    1.0           0
9                                   warder park  6721261    1.0           1
10                       145TH ARMORED REGIMENT  2977538    1.0           0
11  NATIONAL ORGANIZATION FOR WOMEN V SCHEIDLER  1693719    0.0           0
12                                    DEMBINSKA  3580564    0.0           0
13                          VALÉRIE GUIGNABODET  4505632    1.0           0
14                              ФРАНЦА ФОН ЭППА   118347    1.0           0

  mention  entity     prior  entitytype
0     LOD    2010  0.608696           0
1     LOD    2010  0.700000           1
2     LOD  285208  0.000000           0
3     LOD  285208  0.000000           1
4     LOD  285209  0.000000           0
5     LOD  285210  0.130435           0
6     LOD  285211  0.000000           0
7     LOD  285212  0.260870           0
8     LOD  285212  0.300000           1
9     LOD  285213  0.000000           0

In [8]:
if pd.read_sql_query("select exists(select * from information_schema.tables where table_name='dictionary');", korean_conn).exists[0]:
    print("Korean dictionary table already exists!")
    display(pd.read_sql_query("select * from dictionary limit 10;", korean_conn))
else:
    mention2entity_cnt = defaultdict(Counter)
    wrong_lines = []

    with open(train_fn) as train_f:
        for line in tqdm(train_f, total=175873221):
            if line.startswith('## WIKI'):
                tag_line = next(train_f)
                for name, id in re.findall('<ENTITY>(.*?):(.*?)\</ENTITY>', tag_line):
                    if id != "":
                        try:
                            mention2entity_cnt[name][int(id[5:])] += 1
                        except:
                            wrong_lines.append(tag_line)
    dictionary = []
    for mention, cnter in tqdm(mention2entity_cnt.items()):
        total = sum(cnter.values())
        for entity, cnt in cnter.items():
            dictionary.append([mention, entity, cnt / total])

    dictionary_df = pd.DataFrame(dictionary, columns=['mention', 'entity', 'prior'])
    display(dictionary_df)
    display(dictionary_df.loc[dictionary_df['mention'] == '방'])

    dictionary_df.to_sql("dictionary", korean_engine, index=False, if_exists='replace')

Korean dictionary table already exists!

  mention   entity     prior
0     고탄연  1000009  1.000000
1      백제    74135  0.998350
2      백제    30444  0.001650
3      일본   241789  0.983271
4      일본   494179  0.001836
5      일본   662326  0.001887
6      일본  1933358  0.000102
7      일본    37745  0.008109
8      일본    29620  0.002805
9      일본    13794  0.000102

## entity_ids

In [14]:
display(pd.read_sql_query("select * from entity_ids limit 10;", large_conn))

                                        entity knowledgebase       id
0                               <Pinsley_Mill>         YAGO3  1371112
1                     <Huaqiang_North_Station>         YAGO3  2598068
2  <American_Radiator_Company_Factory_Complex>         YAGO3  6067788
3                 <Kupino,_Novosibirsk_Oblast>         YAGO3  1677528
4                    <ru/Новый_год_в_Молдавии>         YAGO3  5120336
5                          <Semecarpus_moonii>         YAGO3  5870080
6          <Constituency_PP-201_(Multan-VIII)>         YAGO3  5330136
7                      <Solar_power_in_Taiwan>         YAGO3  2579254
8        <ru/Треногин,_Владилен_Александрович>         YAGO3  5036825
9                        <Mangoes_(TV_series)>         YAGO3  4568318

In [15]:
! head data/koid2title.txt

10	수학 상수
100	뫼비우스 반전 공식
100000	조국 해방 전쟁
1000002	박파사
1000003	박지마
1000004	가수리군
1000007	분류:대한민국의 고개
1000009	고탄연
100001	조선전쟁
1000010	한국의 고개

In [16]:
if pd.read_sql_query("select exists(select * from information_schema.tables where table_name='entity_ids');", korean_conn).exists[0]:
    print("entity_ids table already exists in Korean database!")
    display(pd.read_sql_query("select * from entity_ids limit 10;", korean_conn))
elif not os.path.isfile(id2title_fn):
    print("id2entity file doesn't exists")
else:
    id2entity = defaultdict(lambda:"")

    """ CANNOT SEE Result
    with open(id2title_fn) as id2title_f:
        for line in id2title_f:
            id, entity = line.split('\t')
            id2entity[int(id)] = entity
    """

    dictionary_df = pd.read_sql_query("select * from dictionary;", korean_conn)
    for a in tqdm(dictionary_df.itertuples()):
        id2entity[a.entity] = a.entity

    table = []
    for id, entity in tqdm(id2entity.items()):
        table.append([str(entity), "WIKI", id])

    entity_ids_df = pd.DataFrame(table, columns=['entity', 'knowledgebase', 'id'])
    display(entity_ids_df)
    
    entity_ids_df.to_sql("entity_ids", korean_engine, index=False, if_exists='replace')

527847it [00:00, 621750.11it/s]
100%|██████████| 336159/336159 [00:00<00:00, 433059.13it/s]

         entity knowledgebase       id
0       1000009          WIKI  1000009
1         74135          WIKI    74135
2         30444          WIKI    30444
3        241789          WIKI   241789
4        494179          WIKI   494179
...         ...           ...      ...
336154   363330          WIKI   363330
336155   999977          WIKI   999977
336156   999984          WIKI   999984
336157   999993          WIKI   999993
336158     4263          WIKI     4263

[336159 rows x 3 columns]

##

## word_ids

In [11]:
display(pd.read_sql_query("select * from word_ids limit 10;", large_conn))
display(pd.read_sql_query("select count(*) from word_ids;", large_conn))

                          word         id
0            Vilniaus valdžiai   25901883
1                 HASSAN ORABI  214224321
2                  Egypt paper   72367140
3                аильный округ  116911886
4                 FACET THEORY  206997019
5                     Gerulata    1462866
6                       中國電影公司    4338138
7                   ' Bakesale  108169983
8  ЯПОНСКОГО АВТОПРОИЗВОДИТЕЛЯ  145264651
9                  Neuroph and   79553879

       count
0  221337208

In [5]:
if pd.read_sql_query("select exists(select * from information_schema.tables where table_name='word_ids');", korean_conn).exists[0]:
    print("word_ids table already exists in Korean database!")
    display(pd.read_sql_query("select * from word_ids limit 10;", korean_conn))
else:
    max_id = 1
    word2id = defaultdict(int)

    with open(train_fn) as train_f:
        for line in tqdm(train_f, total=num_lines):
            if line.startswith('## WIKI_'):
                next(train_f)       # Skip tag line
            elif line == '\n':
                continue
            else:
                word, _, type, _ = line.split()
                if type in key_morphemes and word not in word2id:
                    word2id[word] = max_id
                    max_id += 1

    word_ids = []
    for word, id in word2id.items():
        word_ids.append([word, id])

    word_ids_df = pd.DataFrame(word_ids, columns=['word', 'id'])
    display(word_ids_df)

    word_ids_df.to_sql("word_ids", korean_engine, index=None, if_exists='replace')

100%|█████████▉| 175576639/176169803 [03:24<00:00, 857065.22it/s]

        word      id
0         탄연       1
1        생몰년       2
2         미상       3
3         백제       4
4         왕족       5
...      ...     ...
737363   백민경  737364
737364   여시선  737365
737365  가나와리  737366
737366  가와나리  737367
737367   북한성  737368

[737368 rows x 2 columns]

## word_expansion

In [18]:
display(pd.read_sql_query("select * from word_expansion limit 10;", large_conn))
display(pd.read_sql_query("select * from word_ids where id in (90515063, 194710281, 11243752, 90257019)", large_conn))

        word  expansion
0   90515063  194710281
1   15523755   15523755
2   90515064  194710282
3   90515066  194710283
4   90515065  194710284
5   90515067   90515067
6  113527072  113527072
7   11243752   90257019
8   90515068  194710285
9   90515069  194710286

                    word         id
0  Jedinstvo IGM Crvenka   90515063
1  JEDINSTVO IGM CRVENKA  194710281
2             KATO Works   11243752
3             KATO WORKS   90257019

In [ ]:
if pd.read_sql_query("select exists(select * from information_schema.tables where table_name='word_expansion');", korean_conn).exists[0]:
    print("word_expansion table already exists in Korean database!")
    display(pd.read_sql_query("select * from word_expansion limit 10;", korean_conn))
else:
    word_expansion = []
    for id in pd.read_sql_query("select * from word_ids", korean_conn)['id']:
        word_expansion.append([id, id])
    word_expansion_df = pd.DataFrame(word_expansion, columns=['word', 'expansion'])
    word_expansion_df.to_sql("word_expansion", korean_engine, index=False, if_exists='replace')

## entity_keyphrases

In [23]:
display(pd.read_sql_query("select * from entity_keyphrases limit 10;", large_conn))
display(pd.read_sql_query("select * from word_ids where id in (6796528, 780300, 2712890, 224641, 67984, 227547);", large_conn))
display(pd.read_sql_query("select * from word_expansion where word in (6796528, 780300, 2712890, 224641, 67984, 227547);", large_conn))
display(pd.read_sql_query("select * from word_ids where id in (195716162, 210152060, 136195939, 227547, 178623749, 100239633);", large_conn))

    entity  keyphrase  source  weight  count
0  6796528     780300       4     0.0      3
1  6796528    2712890       3     0.0      3
2  6796528     224641       3     0.0      3
3  6796528      67984       2     0.0      2
4  6796528     227547       2     0.0      2
5  6796528    4968324       4     0.0      3
6  6796528       2311       2     0.0      2
7  6796528     626504       3     0.0      3
8  6796528      83494       2     0.0      2
9  6796528    1274944       3     0.0      3

                                                word       id
0                                     Terry O. Morse  2712890
1  mathematisch-naturwissenschaftlicher Excellenc...  6796528
2                                Lost American films    67984
3                                       Hedda Hopper   224641
4                                            1928年电影   227547
5                                       Янг, Лоретта   780300

      word  expansion
0    67984  136195939
1  6796528  178623749
2   224641  100239633
3  2712890  195716162
4   780300  210152060
5   227547     227547

                                                word         id
0  MATHEMATISCH-NATURWISSENSCHAFTLICHER EXCELLENC...  178623749
1                                       HEDDA HOPPER  100239633
2                                     TERRY O. MORSE  195716162
3                                       ЯНГ, ЛОРЕТТА  210152060
4                                            1928年电影     227547
5                                LOST AMERICAN FILMS  136195939

In [8]:
if pd.read_sql_query("select exists(select * from information_schema.tables where table_name='entity_keyphrases');", korean_conn).exists[0]:
    print("entity_keyphrases table already exists in Korean database!")
    display(pd.read_sql_query("select * from entity_keyphrases limit 10;", korean_conn))
else:
    word_ids_df = pd.read_sql_query("select * from word_ids", korean_conn, index_col='word')

    entity2context_cnter = defaultdict(Counter)
    with open(train_fn) as train_f:
        entity = None
        for line in tqdm(train_f, total=175873221):
            if line.startswith('## WIKI'):
                next(train_f)               # Skip tag line
                entity = line[3:].strip()
            elif line == '\n':
                pass
            else:                
                context, _, type, _ = line.split()
                if type in key_morphemes:   # noun, pronoun, number
                    entity2context_cnter[entity][context] += 1

    table = []
    for e, context_cnt in entity2context_cnter.items():
        for context, cnt in context_cnt.items():
            table.append([int(e[5:]), word_ids_df.loc[context, 'id'], 'WIKI', cnt])
    
    entity_keyphrases_df = pd.DataFrame(table, columns=['entity', 'keyphrase', 'source', 'count'])
    display(entity_keyphrases_df)
    
    entity_keyphrases_df.to_sql("entity_keyphrases_df", korean_engine, index=False, if_exists='replace')

100%|█████████▉| 175576639/175873221 [04:00<00:00, 729646.89it/s]

           entity  keyphrase source  count
0         1000009          1   WIKI      1
1         1000009          2   WIKI      1
2         1000009          3   WIKI      1
3         1000009          4   WIKI      2
4         1000009          5   WIKI      2
...           ...        ...    ...    ...
26832944   999993        537   WIKI      1
26832945   999993        319   WIKI      2
26832946   999993     598764   WIKI      1
26832947   999993      16582   WIKI      1
26832948   999993       2876   WIKI      1

[26832949 rows x 4 columns]

In [13]:
# display(pd.read_sql_query("select * from entity_keyphrases where entity = 999993 limit 10;", korean_conn))
display(pd.read_sql_query("select * from word_ids where id in (42, 3700, 2222) limit 10;", korean_conn))

   entity  keyphrase source  count  weight
0  999993         42   WIKI      1       0
1  999993        969   WIKI      1       0
2  999993     108876   WIKI      3       0
3  999993          4   WIKI      1       0
4  999993          5   WIKI      1       0
5  999993        439   WIKI      1       0
6  999993        311   WIKI      3       0
7  999993     352697   WIKI      4       0
8  999993      32982   WIKI      2       0
9  999993      54697   WIKI      2       0

  word    id
0    9    42
1   군사  2222
2   근거  3700

## keyword_counts

In [9]:
display(pd.read_sql_query("select * from keyword_counts order by count desc limit 10;", large_conn))
display(pd.read_sql_query("select * from word_ids where id in (2, 4, 3, 5, 46, 7, 6);", large_conn))

   keyword    count
0        2  3921889
1        4  3805000
2        3  3745612
3        5  3191552
4       46  3095825
5        7  3095755
6        6  2708493
7       11  2264291
8        9  2191242
9        8  2093168

  word  id
0   of   2
1    ,   3
2    )  46
3    (   7
4  the   6
5   de   5
6   in   4

In [11]:
if pd.read_sql_query("select exists(select * from information_schema.tables where table_name='keyword_counts');", korean_conn).exists[0]:
    print("keyword_counts table already exists in Korean database!")
    display(pd.read_sql_query("select * from keyword_counts limit 10;", korean_conn))
else:
    keyword_counts = Counter()
    with open(train_fn) as train_f:
        for line in tqdm(train_f, total=175873221):
            if line.startswith('## WIKI'):
                next(train_f)               # Skip tag line
            elif line == '\n':
                pass
            else:                
                word, _, type, _ = line.split()
                if type in key_morphemes:   # noun, pronoun, number
                    keyword_counts[word] += 1
        for word, count in keyword_counts.items():

# Prior